# IsNavisworksExporterAvailable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OptionalFunctionalityUtils..::..IsNavisworksExporterAvailable Method
OptionalFunctionalityUtils Class See Also
---
Checks whether a Navisworks Exporter is available in the installed Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool IsNavisworksExporterAvailable()
```

Visual Basic
---
```text
Public Shared Function IsNavisworksExporterAvailable As Boolean
```

Visual C++
---
```text
public:
static bool IsNavisworksExporterAvailable()
```

# ### Return Value
True if a Navisworks Exporter is available in the installed Revit.
# Remarks
A Navisworks exporter is registered via an external add-in. If no add-in has registered an exporter, this will not be a part of the session.
# See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace